canyon/canyonBack_1.5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    street
    {
        type            wall;
        inGroups        1(wall);
        nFaces          84;
        startFace       40909;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20605;
        startFace       40993;
    }
    sky
    {
        type            patch;
        nFaces          144;
        startFace       61598;
    }
    inflow
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          91;
        startFace       61742;
        matchTolerance  0.0001;
//        transform       unknown;
        neighbourPatch  outflow;
    }
    outflow
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          91;
        startFace       61833;
        matchTolerance  0.0001;
//        transform       unknown;
        neighbourPatch  inflow;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20605;
        startFace       61924;
    }
    bldgFront
    {
        type            wall;
        inGroups        1(wall);
        nFaces          198;
        startFace       82529;
    }
    bldgBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          389;
        startFace       82727;
    }
)

// ************************************************************************* //
