canyon/canyonBack_1.5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam2;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         40000;

deltaT          1;

writeControl    timeStep;

writeInterval   1500;                        

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs 
(
    "libatmosphericModels.so" 
    //"libABLFvOptions.so"
);

functions 
{
    #includeFunc residuals
    //#includeFunc verticalProfiles

    #includeFunc  singleGraph

};
// ************************************************************************* //
