canyon/canyonBack_1.5/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        ncellsInCoarsestLevel  1000;
        mergeLevels      1;
    }

    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-12;
        relTol           0.01;
        nSweeps          1;
    }

    b
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-12;
        relTol           0.01;
        nSweeps          1;
    }

    // U
    // {
    // type            coupled;  // optional, defaults to segregated
    // solver          PBiCCCG;
    // preconditioner  DILU;
    // tolerance       (1e-08 1e-08 1e-08);
    // relTol          (0.01 0.01 0.01);
    // }

    k
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-12;
        relTol           0.01;
        nSweeps          1;
    }

    c
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-12;
        relTol           0.01;
        nSweeps          1;
    }

    epsilon
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-12;
        relTol           0.01;
        nSweeps          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    consistent      yes;

    residualControl
    {
        p               1e-4;           //standard: 1e-04
        U               1e-4;
        "(k|epsilon|c|b)"   1e-3;       //standard: 1e-03
    }
}

relaxationFactors
{
    fields
    {
        p               0.2;             //standard 0.3
    }
    equations
    {
        U               0.7;
        k               0.7;
        epsilon         0.7;
        c               0.7;
        b               0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
